ArtShare/app/controllers/artworks_controller.rb

    def create
    art = Artwork.new(artwork_params)
        # replace the art_attributes_here` with the actual attribute keys
        if art.save
---
INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "starry"], ["image_url", "helloimage"], ["artist_id", 3], ["created_at", "2023-03-10 00:12:16.395961"], ["updated_at", "2023-03-10 00:12:16.395961"]]

    def show
        art = Artwork.find_by(id: params[:id])
        if art.nil?
            render plain: 'art doesnt exist'
        else
            render json: Artwork.find(params[:id])
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update

        art = Artwork.find_by(id: params[:id])
        if art.nil?
            render plain: 'art doesnt exist'
        else
            art.update!(artwork_params)
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "image_url" = $2, "artist_id" = $3, "updated_at" = $4 WHERE "artworks"."id" = $5  [["title", "its rainging"], ["image_url", "getout"], ["artist_id", 2], ["updated_at", "2023-03-10 00:15:31.838916"], ["id", 1]]

    def destroy
        art = Artwork.find_by(id: params[:id])
        if art.nil?
            render plain: 'art doesnt exist'
            # render json: art.errors.full_messages, status: :unprocessable_entity
        else
            art.delete
            render json: Artwork.all
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 1]]
SELECT "artworks".* FROM "artworks"