ArtShare/app/controllers/artwork_shares_controller.rb

    def create
    share = ArtworkShare.new(artwork_share_params)
    # debugger
        # replace the art_attributes_here` with the actual attribute keys
        if share.save!
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 2], ["viewer_id", 3], ["created_at", "2023-03-10 00:47:12.645724"], ["updated_at", "2023-03-10 00:47:12.645724"]]

    def destroy
        share = ArtworkShare.find_by(id: params[:id])
        if share.nil?
            render plain: 'share doesnt exist'
            # render json: share.errors.full_messages, status: :unprocessable_entity
        else
            share.delete
            render json: ArtworkShare.all
---
SELECT "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 1]]
SELECT "artwork_shares".* FROM "artwork_shares"