ArtShare/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "dan"], ["created_at", "2023-03-09 23:28:18.118146"], ["updated_at", "2023-03-09 23:28:18.118146"]]
---
    def create
        user = User.new(params.require(:user).permit(:username))
        # replace the `user_attributes_here` with the actual attribute keys
        if user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        user = User.find_by(id: params[:id])
        if user.nil?
            render plain: 'user doesnt exist'
        else
            render json: User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "daniel"], ["updated_at", "2023-03-09 23:34:17.622452"], ["id", 2]]
---
    def update

        user = User.find_by(id: params[:id])
        if user.nil?
            render plain: 'user doesnt exist'
        else
            user.update!(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
SELECT "users".* FROM "users"
---
    def destroy
        user = User.find_by(id: params[:id])
        if user.nil?
            render plain: 'user doesnt exist'
            # render json: user.errors.full_messages, status: :unprocessable_entity
        else
            user.delete
            render json: User.all